package com.henong.android.widget.calendar.utils;

import java.util.Calendar;
/**
 * 
 *
 * FILE: GregorianUtil.java
 *
 * MODULE: com.henong.android.widget.calendar.utils
 *
 * PURPOSE: 对公历日期的处理类
 *
 * AUTHOR(S): Joker.Chen
 *
 * GROUP: R&D
 *
 * DATE CREATED: 2016-11-16
 *
 * REFERENCE DOCUMENT ID: 
 *
 * MODIFICATIONS:
 * Date       user Name   Description
 * 2016-11-16    Joker       Create this file
 */
public class GregorianUtil {
	 private final static String[][] GRE_FESTVIAL = {
         // 一月
         { "元旦", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                 "", "", "", "", "", "", "", "", "", "", "", "", "", "", "" },
         // 二月
         { "", "", "", "", "", "", "", "", "", "", "", "", "", "情人节", "", "",
                 "", "", "", "", "", "", "", "", "", "", "", "", "", "" },
         // 三月
         { "", "", "", "", "", "", "", "妇女节", "", "", "", "植树节", "", "", "",
                 "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                 "" },
         // 四月
         { "愚人节", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                 "", "", "", "", "", "", "", "", "", "", "", "", "", "", "" },
         // 五月
         { "劳动节", "", "", "青年节", "", "", "", "", "", "", "", "", "", "", "",
                 "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                 "" },
         // 六月
         { "儿童节", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                 "", "", "", "", "", "", "", "", "", "", "", "", "", "", "" },
         // 七月
         { "建党节", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                 "", "", "", "", "", "", "", "", "", "", "", "", "", "", "" },
         // 八月
         { "建军节", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                 "", "", "", "", "", "", "", "", "", "", "", "", "", "", "" },
         // 九月
         { "", "", "", "", "", "", "", "", "", "教师节", "", "", "", "", "", "",
                 "", "", "", "", "", "", "", "", "", "", "", "", "", "", "" },
         // 十月
         { "国庆节", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                 "", "", "", "", "", "", "", "", "", "", "", "", "", "", "" },
         // 十一月
         { "", "", "", "", "", "", "", "", "", "", "光棍节", "", "", "", "", "",
                 "", "", "", "", "", "", "", "", "", "", "", "", "", "", "" },
         // 十二月
         { "艾滋病", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                 "", "", "", "", "", "", "", "", "", "圣诞节", "", "", "", "",
                 "", "" }, };
	 private int mMonth;
	 private int mDay;
	
	 public GregorianUtil(Calendar calendar) {
	     mMonth = calendar.get(Calendar.MONTH);
	     mDay = calendar.get(Calendar.DATE);
	 }
	
	 public String getGremessage() {
	     return GRE_FESTVIAL[mMonth][mDay - 1];
	 }
}
